/* `welcomeLabel` UILabel text default value */
"Welcome" = "Tere tulemast!";

/* `thankyouLabel` UILabel text default value */
"ThankyouMessage" = "Täname allalaadimise eest";

/* `instructionTextView` UITextView text default value with \".notConfigurated\" state */
"WelcomeInstruction" = "Aktiveerimisprotsessi alustamiseks järgige tervitusmeilis saadud juhiseid.";

/* `instructionTextView` UITextView text default value with \".isConfigured\" state */
"ConfiguredInstruction" = "Hallake oma igapäevatoiminguid ja tehke hõlpsasti projektide kallal koostööd.";

"ScanInstruction" = "Aktiveerimisprotsessi alustamiseks skannige turvaline QR-kood.";

"DiscoveryServiceInstruction" = "Aktiveerimisprotsessi alustamiseks sisestage oma meiliaadress.";

/* checking the account(email address) user entered in discovery service */
"CheckingAccountKey" = "Konto kontrollimine...";

/* `signInButton` UIButton's titleLabel?.text default value */
"SignIn" = "Alusta";

"Scan" = "Skanni";

/* `demoLabel` UILabel text default value */
"Explore" = "Kas soovite uurida?";

/* `demoButton` UIButton's titleLabel?.text default value */
"TryDemo" = "Proovi demo";

/* The title for the passcode setup screens. */
"SetPasscodeKey" = "Määra pääsukood";

/* The title for the enter passcode screen. */
"PasscodeKey" = "Pääsukood";

/* The title for the Choose Passcode screen. */
"ChoosePasscodeTitleKey" = "Pääsukoodi valimine";

/* The title for the Confirm Passcode screen. */
"ConfirmPasscodeTitleKey" = "Pääsukoodi kinnitamine";

/* The message on the confirm passcode screen for passcode setup. */
"EnterPasscodeAgainKey" = "Sisestage pääsukood uuesti.";

/* The message on the confirm passcode screen for passcode change. */
"ConfirmPasscodeKey" = "Kinnitage oma pääsukood.";

/* The message on the input passcode screen. */
"EnterYourPasscodeKey" = "Sisestage oma pääsukood.";

/* The title for the passcode change screens. */
"ChangePasscodeKey" = "Muuda pääsukoodi";

/* The message on the input passcode screen in change passcode. */
"EnterYourCurrentPasscodeKey" = "Sisestage oma praegune pääsukood.";

/* The button title string used both in passcode and\n touch ID screens to indicate not to setup now. */
"NotNowKey" = "Mitte praegu";

/* The button title string used on the second passcode setup\n to go back to the first screen. */
"BackKey" = "Tagasi";

/* The button title string used on the first passcode setup\n to go to the next screen. */
"NextKey" = "Edasi";

/* The button title string used on the passcode input screen (not in the change passcode sequence)\n When the passcode input screen is in the change passcode sequence, the button title should be changed \"Next\" */
"DoneKey" = "Valmis";

/* The main message format on the setup passscode screen.\n The %d will display the number of characters required from\n the passcode policy. */
"PasscodeChooseMinCharKey" = "Rakenduse avamiseks valige vähemalt %d-märgiline pääsukood.";

/* The main message format on the setup passscode screen when the\n isDititsOnly property of the passcode policy is true.\n The %d will display the number of digits required from\n the passcode policy. */
"PasscodeChooseMinDigitKey" = "Rakenduse avamiseks valige vähemalt %d-kohaline pääsukood.";

/* The message for passcode to include the required character groups\n when passcode policy requires it. */
"PasscodeRequiredGroupKey" = "Lisage järgmised:";

/* The group name for lower case letters. */
"LowerCaseKey" = "väiketäht (a–y)";

/* The group name for upper case letters. */
"UpperCaseKey" = "suurtäht (A–Y)";

/* The group name for digits. */
"DigitsKey" = "numbrid (0–9)";

/* The group name for non-alphabetic characters. */
"Non-alphaKey" = "sümbolid (!@#...)";

/* The button title for resetting passcode. */
"ResetPasscodeKey" = "Lähtesta pääsukood";

/* Alert message when validate method of FUIPasscodeValidationDelegate\n returning false for the passcode user entered in setup passcode. */
"PasscodeValidationFailedKey" = "Pääsukoodi valideerimine nurjus.";

/* Alert message when the passcode user entered was rejected by\n the FUIPasscodeControllerDelegate's shouldTryPasscode function. */
"PasscodeRejectedKey" = "FUIPasscodeControllerDelegate lükkas pääsukoodi tagasi.";

/* The alert button title used on passcode validation failed, or passcode rejected. */
"RetryKey" = "Proovi uuesti";

/* The title for setup touch ID screen. */
"TouchIDKey" = "Touch ID";

/* The title for setup touch ID screen. */
"FaceIDKey" = "Face ID";

/* This is to be used combined with \"Touch ID\" or \"Face ID\", e.g., \"Touch ID is now available!\" */
"IsNowAvailableKey" = " on nüüd saadaval!";

/* The first paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage1Key" = "Touch ID lubamise korral pääsete kiiremini oma teabele juurde.";

/* The second paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage2Key" = "Saate selle funktsiooni igal ajal sätetes sisse või välja lülitada.";

/* The first paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage1Key" = "Kiire ja turvalise juurdepääsu saamiseks lubage Touch ID.";

/* The second paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage2Key" = "Kui Touch ID on desaktiveeritud, küsitakse teilt seadme pääsukoodi.";

/* The first paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage1Key" = "Face ID lubamise korral pääsete kiiremini oma teabele juurde.";

/* The second paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage2Key" = "Saate selle funktsiooni igal ajal sätetes sisse või välja lülitada.";

/* The first paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage1Key" = "Kiire ja turvalise juurdepääsu saamiseks lubage Face ID.";

/* The second paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage2Key" = "Kui Face ID on desaktiveeritud, küsitakse teilt seadme pääsukoodi.";

/* The alert title to ask user add fingerprints to use Touch ID. */
"UseTouchIDTitleKey" = "Touch ID kasutamiseks lisage oma seadme sätetes sõrmejäljed.";

/* The alert message to ask user add fingerprints to use Touch ID. */
"UseTouchIDMessageKey" = "Saate seda teha igal ajal jaotises Sätted – Touch ID & pääsukood.";

/* The alert title to ask user add fingerprints to use Face ID. */
"UseFaceIDTitleKey" = "Face ID kasutamiseks registreerige oma seadme sätetes Face ID.";

/* The alert message to ask user add fingerprints to use Face ID. */
"UseFaceIDMessageKey" = "Saate seda teha igal ajal jaotises Sätted – Face ID & pääsukood.";

/* The message for the link on the Touch ID screen. */
"LearnMoreKey" = "Lisateave Touch ID kohta";

/* The message for the link on the Face ID screen. */
"LearnMoreFaceIDKey" = "Lisateave Face ID kohta";

/* The button title to enable Touch ID authentication. */
"EnableKey" = "Luba";

/* The message displayed when authticate with Touch ID. */
"AuthWithTouchIDKey" = "Autendi Touch ID-ga";

/* The message displayed when authticate with Face ID. */
"AuthWithFaceIDKey" = "Autendi Face ID-ga";

/* The title on the navigation bar. */
"TouchIDErrorNavigationTitleKey" = "Tõrge";

/* The error title. */
"AuthenticationErrorKey" = "Autentimistõrge";

/* The error message for Touch ID devices. */
"AuthenticationTouchIDMessageKey" = "Rakenduse kasutamiseks autentige end Touch ID abil.";

/* The error message for Face ID devices. */
"AuthenticationFaceIDMessageKey" = "Rakenduse kasutamiseks autentige end Face ID abil.";

/* The authenticate button text. */
"AuthenticateKey" = "Autendi";

/* The message when the passcode entered in confirm passcode screen\n does not match with the one entered in the setup passcode screen. */
"PasscodeNotMatchKey" = "Pääsukoodid polnud vastavuses. Proovige uuesti.";

/* The message format to be displayed when user entered wrong passcode\n and the remaining number of retries is greater than 1. */
"AttemptsLeftKey" = "Teil on veel %d katset.";

/* The message format to be displayed when user entered wrong passcode\n and there is only one remaining retry. */
"OneAttemptLeftKey" = "Teil on veel üks katse.";

/* The first paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"MaxAttemptsReachedKey" = "Rohkem katseid pole.";

/* The second paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"EnterCredentialsKey" = "Pääsukoodi lähtestamiseks logige sisse.";

/* The text of the dismiss button on the alert. */
"OKKey" = "OK";

/* The message on the passcode screen when user entered wrong passcode\n and there is no limit on the number of retries. */
"RetryPasscodeKey" = "Vale pääsukood. Proovige uuesti.";

/* The scan page title string. */
"ScanKey" = "Skanni";

/* The title of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"ScanUnsuccessfulKey" = "Skannimine ei õnnestunud";

/* The second line of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"SelectAnotherImageKey" = "Valige QR-koodi pilt.";

/* The title of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"InvalidQRCodeKey" = "Sobimatu QR-kood";

/* The second line of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"QRCodeNotRecognizedKey" = "QR-koodi ei tuvastatud.";

/* The title of the alert to request photo access. */
"AllowPhotoAccessKey" = "Luba juurdepääs fotodele";

/* The message of the alert to request photo access. */
"GiveAccessToPhotoSettingsKey" = "QR-koodi pildi valimiseks andke oma seadme privaatsussätetes juurdepääs oma fotodele.";

/* The title of the alert to request camera access. */
"AllowCameraAccessKey" = "Luba juurdepääs kaamerale";

/* The message of the alert to request camera access. */
"GiveAccessToCameraSettingsKey" = "Kaamera abil skannimiseks andke seadme privaatsussätetes juurdepääs oma kaamerale.";

/* *\n The alert action title to go to Settings app. */
"SettingsKey" = "Sätted";

/* The title string for the QR code scan confirmation screen. */
"ConfirmationKey" = "Kinnitus";

/* The success message for the QR code scan confirmation screen. */
"ScanSucceededKey" = "Skannimine õnnestus. Teie jaoks luuakse ühendus järgmisega:";

/* The title string for the \"Continue\" button */
"ContinueKey" = "Jätka";

/* The title string for the back bar button on activation screen */
"BackBarButtonForActivationScreenKey" = "Käivita";

/* FUIActivation Screen - headlineLabel */
"FUIActivationScreen_headlineLabel" = "Aktiveerimine";

/* FUIActivation Screen - detailLabel */
"FUIActivationScreen_detailLabel" = "Kui saite tervitusmeili, klõpsake meilis olevat aktiveerimislinki. Muul juhul sisestage kasutuselevõtu alustamiseks oma meiliaadress või skannige QR-kood.";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_primaryActionButtonTitle" = "Edasi";

/* FUIActivation Screen - subheadlineLabel */
"FUIActivationScreen_subheadlineLabel" = "Või";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_secondaryActionButtonTitle" = "Skanni";

/* FUIEULAView Screen - agree button */
"AgreeKey" = "Nõustu";

/* FUIEULAView Screen - disagree button */
"DisagreeKey" = "Ei nõustu";

/* The authentication title. */
"AuthenticationKey" = "Autentimine";

/* The basic authentication message. */
"basicAuthenticationMessageKey" = "Autentimiseks sisestage oma kasutajanimi ja parool.";

/* Username input field placeholder string */
"usernameKey" = "kasutajanimi";

/* Password input field placeholder string */
"passwordKey" = "parool";

/* Sign In button string. */
"SignInKey" = "Logi sisse";

/* Error message when failed to sign in. */
"SignInErrorKey" = "Vale mandaat. Proovige uuesti.";

/* The dynamic authentication message. */
"DynamicAuthenticationMessageKey" = "Aktiveerimisprotsessi alustamiseks esitage allolev teave.";

/* The message displayed on the banner when verifying information user entered. */
"VerifyingMessageKey" = "Teabe kinnitamine...";

/* Cancel button string. */
"CancelKey" = "Tühista";

/* Allow button string. */
"AllowKey" = "Luba";

/* Deny button string. */
"DenyKey" = "Keela";

/* No button string. */
"NoKey" = "Ei";

/* Quit button string. */
"QuitKey" = "Katkesta";

/* GiveConsent button string. */
"GiveConsentKey" = "Anna nõusolek";

/* Navbar title string. */
"StepKey" = "Toiming";

/* Navbar title string. */
"OfKey" = "/";

/* CancelConfirmation message string. */
"CancelConfirmationKey" = "Kas soovite kasutuselevõtuprotsessi kindlasti katkestada?";

/* MandatoryMessage button string. */
"MandatoryMessageKey" = "Kasutuselevõttu ei saa ilma nõusolekuta jätkata.";

/* Switch User button string. */
"SwitchOrAddUserKey" = "Vaheta kasutajat või lisa kasutaja";

/* Title for Log In button */
"LogInKey" = "Logi sisse";

/* Placeholder text in search bar for searching users in multi-user login controller */
"SearchUsersKey" = "Otsi kasutajaid sellest seadmest";

/* The button title for forgot passcode. */
"ForgotPasscodeKey" = "Kas unustasite pääsukoodi?";

